DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
/** CHART2-A.NSA
/** Version: 0.8
/** Copyright 2015 Thomas Schwade
/** http://www.zerodrive.net
/** Licensed under the EUPL V.1.1
/** https://github.com/zerodrive/NJX-ZDCharts/blob/master/LICENSE.pdf
/** Use this data structure for the Polar area, Pie chart and Doughnut chart.
/**
1 CHART2-A
2 DSERIES (1:*)
3 DPROPS (1:*)
4 PNAME (U) DYNAMIC
4 PVALUE (U) DYNAMIC
3 DDATA (P9.2)
END-DEFINE
